#+title: Rust 的显式类型转换
#+BEGIN_SRC rust
fn main() {
    let a = std::u32::MAX;
    let b = a as u16;
    assert_eq!(b, 65535);
    let e = -1i32;
    let f = e as u32;
    println!("{:?}", e.abs());
    println!("{:?}", f);
}
#+END_SRC

#+RESULTS:
: 1
: 4294967295

使用 as 操作符时要注意：
1. 短类型转换为长类型时没有问题，长类型转换成短类型时会被截断
2. 从有符号类型转为无符号类型时，最好使用标准库中提供的专门方法，而不是使用 as 操作符
